Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
					<register>
						<name>GPIO_CFGCTL30</name>
						<description>GPIO_CFGCTL30.</description>
						<addressOffset>0x180</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_22_i</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_gpio_21_i</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_20_i</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_i</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_18_i</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_gpio_17_i</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_16_i</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_15_i</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_14_i</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_gpio_13_i</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_gpio_12_i</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_11_i</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_10_i</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_gpio_9_i</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_gpio_8_i</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_gpio_7_i</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_gpio_6_i</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_gpio_5_i</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_i</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_3_i</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_i</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_gpio_1_i</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_i</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL31</name>
						<description>GPIO_CFGCTL31.</description>
						<addressOffset>0x184</addressOffset>
						<fields/>
					</register>
					<register>
						<name>GPIO_CFGCTL32</name>
						<description>GPIO_CFGCTL32.</description>
						<addressOffset>0x188</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_22_o</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_gpio_21_o</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_20_o</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_o</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_18_o</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_gpio_17_o</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_16_o</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_15_o</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_14_o</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_gpio_13_o</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_gpio_12_o</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_11_o</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_10_o</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_gpio_9_o</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_gpio_8_o</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_gpio_7_o</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_gpio_6_o</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_gpio_5_o</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_o</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_3_o</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_o</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_gpio_1_o</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_o</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL33</name>
						<description>GPIO_CFGCTL33.</description>
						<addressOffset>0x18C</addressOffset>
						<fields/>
					</register>
					<register>
						<name>GPIO_CFGCTL34</name>
						<description>GPIO_CFGCTL34.</description>
						<addressOffset>0x190</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_22_oe</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_gpio_21_oe</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_20_oe</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_oe</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_18_oe</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_gpio_17_oe</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_16_oe</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_15_oe</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_14_oe</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_gpio_13_oe</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_gpio_12_oe</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_11_oe</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_10_oe</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_gpio_9_oe</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_gpio_8_oe</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_gpio_7_oe</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_gpio_6_oe</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_gpio_5_oe</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_oe</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_3_oe</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_oe</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_gpio_1_oe</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_oe</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL35</name>
						<description>GPIO_CFGCTL35.</description>
						<addressOffset>0x194</addressOffset>
						<fields/>
					</register>
					<register>
						<name>GPIO_INT_MASK1</name>
						<description>GPIO_INT_MASK1.</description>
						<addressOffset>0x1A0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mask1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_STAT1</name>
						<description>GPIO_INT_STAT1.</description>
						<addressOffset>0x1A8</addressOffset>
						<fields>
							<field>
								<name>gpio_int_stat1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_CLR1</name>
						<description>GPIO_INT_CLR1.</description>
						<addressOffset>0x1B0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_clr1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_MODE_SET1</name>
						<description>GPIO_INT_MODE_SET1.</description>
						<addressOffset>0x1C0</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mode_set1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_MODE_SET2</name>
						<description>GPIO_INT_MODE_SET2.</description>
						<addressOffset>0x1C4</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mode_set2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_INT_MODE_SET3</name>
						<description>GPIO_INT_MODE_SET3.</description>
						<addressOffset>0x1C8</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_int_mode_set3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>led_driver</name>
						<description>led_driver.</description>
						<addressOffset>0x224</addressOffset>
						<fields>
							<field>
								<name>pu_leddrv</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ir_rx_gpio_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>leddrv_ibias</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>led_din_polarity_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>led_din_sel</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>led_din_reg</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_ctrl</name>
						<description>gpdac_ctrl.</description>
						<addressOffset>0x308</addressOffset>
						<fields>
							<field>
								<name>gpdac_reserved</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpdac_test_sel</name>
								<lsb>9</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gpdac_ref_sel</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpdac_test_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gpdacb_rstn_ana</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdaca_rstn_ana</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_actrl</name>
						<description>gpdac_actrl.</description>
						<addressOffset>0x30C</addressOffset>
						<fields>
							<field>
								<name>gpdac_a_outmux</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gpdac_a_rng</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_ioa_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_a_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_bctrl</name>
						<description>gpdac_bctrl.</description>
						<addressOffset>0x310</addressOffset>
						<fields>
							<field>
								<name>gpdac_b_outmux</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gpdac_b_rng</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_iob_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_b_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_data</name>
						<description>gpdac_data.</description>
						<addressOffset>0x314</addressOffset>
						<fields>
							<field>
								<name>gpdac_a_data</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gpdac_b_data</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_0</name>
						<description>tzc_glb_ctrl_0.</description>
						<addressOffset>0xF00</addressOffset>
						<fields>
							<field>
								<name>tzc_glb_clk_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_glb_mbist_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tzc_glb_dbg_lock</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tzc_glb_bmx_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_l2c_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_sram_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_misc_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_ungated_ap_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_sys_reset_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_cpu_reset_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_pwron_rst_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s30_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s01_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s00_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_1</name>
						<description>tzc_glb_ctrl_1.</description>
						<addressOffset>0xF04</addressOffset>
						<fields>
							<field>
								<name>tzc_glb_swrst_s1f_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1e_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1d_lock</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1c_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1b_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1a_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s19_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s18_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s17_lock</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s16_lock</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s15_lock</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s14_lock</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s13_lock</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s12_lock</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s11_lock</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s10_lock</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2f_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2e_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2d_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2c_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2b_lock</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2a_lock</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s29_lock</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s28_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s27_lock</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s26_lock</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s25_lock</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s24_lock</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s23_lock</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s22_lock</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s21_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s20_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_2</name>
						<description>tzc_glb_ctrl_2.</description>
						<addressOffset>0xF08</addressOffset>
						<fields>
							<field>
								<name>tzc_glb_gpio_28_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_27_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_26_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_25_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_24_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_23_lock</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_22_lock</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_21_lock</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_20_lock</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_19_lock</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_18_lock</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_17_lock</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_16_lock</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_15_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_14_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_13_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_12_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_11_lock</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_10_lock</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_9_lock</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_8_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_7_lock</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_6_lock</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_5_lock</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_4_lock</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_3_lock</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_2_lock</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_1_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_gpio_0_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_3</name>
						<description>tzc_glb_ctrl_3.</description>
						<addressOffset>0xF0C</addressOffset>
						<fields/>
					</register>
