Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>sec_eng</name>
				<description>sec_eng.</description>
				<baseAddress>0x40004000</baseAddress>
				<groupName>sec_eng</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>se_sha_0_ctrl</name>
						<description>se_sha_0_ctrl.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_msg_len</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_sha_0_link_mode</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_sha_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_sha_0_int_set_1t</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_sha_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_sha_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>se_sha_0_hash_sel</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>se_sha_0_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>se_sha_0_mode</name>
								<lsb>2</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>se_sha_0_trig_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_sha_0_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_msa</name>
						<description>se_sha_0_msa.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_msa</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_status</name>
						<description>se_sha_0_status.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_endian</name>
						<description>se_sha_0_endian.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_dout_endian</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_0</name>
						<description>se_sha_0_hash_l_0.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_1</name>
						<description>se_sha_0_hash_l_1.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_2</name>
						<description>se_sha_0_hash_l_2.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_3</name>
						<description>se_sha_0_hash_l_3.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_4</name>
						<description>se_sha_0_hash_l_4.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_5</name>
						<description>se_sha_0_hash_l_5.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_6</name>
						<description>se_sha_0_hash_l_6.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_7</name>
						<description>se_sha_0_hash_l_7.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_l_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_0</name>
						<description>se_sha_0_hash_h_0.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_1</name>
						<description>se_sha_0_hash_h_1.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_2</name>
						<description>se_sha_0_hash_h_2.</description>
						<addressOffset>0x38</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_3</name>
						<description>se_sha_0_hash_h_3.</description>
						<addressOffset>0x3C</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_4</name>
						<description>se_sha_0_hash_h_4.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_5</name>
						<description>se_sha_0_hash_h_5.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_6</name>
						<description>se_sha_0_hash_h_6.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_7</name>
						<description>se_sha_0_hash_h_7.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_hash_h_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_link</name>
						<description>se_sha_0_link.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>se_sha_0_lca</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_ctrl_prot</name>
						<description>se_sha_0_ctrl_prot.</description>
						<addressOffset>0xFC</addressOffset>
						<fields>
							<field>
								<name>se_sha_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_sha_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_sha_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_ctrl</name>
						<description>se_aes_0_ctrl.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_msg_len</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_aes_0_link_mode</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_aes_0_iv_sel</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>se_aes_0_block_mode</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>se_aes_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_aes_0_int_set_1t</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_aes_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_aes_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>se_aes_0_hw_key_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>se_aes_0_dec_key_sel</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>se_aes_0_dec_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>se_aes_0_mode</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>se_aes_0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_aes_0_trig_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_aes_0_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_msa</name>
						<description>se_aes_0_msa.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_msa</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_mda</name>
						<description>se_aes_0_mda.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_mda</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_status</name>
						<description>se_aes_0_status.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_0</name>
						<description>se_aes_0_iv_0.</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_iv_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_1</name>
						<description>se_aes_0_iv_1.</description>
						<addressOffset>0x114</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_iv_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_2</name>
						<description>se_aes_0_iv_2.</description>
						<addressOffset>0x118</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_iv_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_3</name>
						<description>se_aes_0_iv_3.</description>
						<addressOffset>0x11C</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_iv_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_0</name>
						<description>se_aes_0_key_0.</description>
						<addressOffset>0x120</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_1</name>
						<description>se_aes_0_key_1.</description>
						<addressOffset>0x124</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_2</name>
						<description>se_aes_0_key_2.</description>
						<addressOffset>0x128</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_3</name>
						<description>se_aes_0_key_3.</description>
						<addressOffset>0x12C</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_4</name>
						<description>se_aes_0_key_4.</description>
						<addressOffset>0x130</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_5</name>
						<description>se_aes_0_key_5.</description>
						<addressOffset>0x134</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_6</name>
						<description>se_aes_0_key_6.</description>
						<addressOffset>0x138</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_7</name>
						<description>se_aes_0_key_7.</description>
						<addressOffset>0x13C</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_sel_0</name>
						<description>se_aes_0_key_sel_0.</description>
						<addressOffset>0x140</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_sel_0</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_sel_1</name>
						<description>se_aes_0_key_sel_1.</description>
						<addressOffset>0x144</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_key_sel_1</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_endian</name>
						<description>se_aes_0_endian.</description>
						<addressOffset>0x148</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_ctr_len</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_aes_0_iv_endian</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_aes_0_key_endian</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_aes_0_din_endian</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_aes_0_dout_endian</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_sboot</name>
						<description>se_aes_0_sboot.</description>
						<addressOffset>0x14C</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_sboot_key_sel</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_link</name>
						<description>se_aes_0_link.</description>
						<addressOffset>0x150</addressOffset>
						<fields>
							<field>
								<name>se_aes_0_lca</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_ctrl_prot</name>
						<description>se_aes_0_ctrl_prot.</description>
						<addressOffset>0x1FC</addressOffset>
						<fields>
							<field>
								<name>se_aes_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_aes_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_aes_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_0</name>
						<description>se_trng_0_ctrl_0.</description>
						<addressOffset>0x200</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_manual_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_trng_0_manual_reseed</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>se_trng_0_manual_fun_sel</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>se_trng_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_trng_0_int_set_1t</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_trng_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_trng_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>se_trng_0_ht_error</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>se_trng_0_dout_clr_1t</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_trng_0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_trng_0_trig_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_trng_0_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_status</name>
						<description>se_trng_0_status.</description>
						<addressOffset>0x204</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_0</name>
						<description>se_trng_0_dout_0.</description>
						<addressOffset>0x208</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_1</name>
						<description>se_trng_0_dout_1.</description>
						<addressOffset>0x20C</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_2</name>
						<description>se_trng_0_dout_2.</description>
						<addressOffset>0x210</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_3</name>
						<description>se_trng_0_dout_3.</description>
						<addressOffset>0x214</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_4</name>
						<description>se_trng_0_dout_4.</description>
						<addressOffset>0x218</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_5</name>
						<description>se_trng_0_dout_5.</description>
						<addressOffset>0x21C</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_6</name>
						<description>se_trng_0_dout_6.</description>
						<addressOffset>0x220</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_7</name>
						<description>se_trng_0_dout_7.</description>
						<addressOffset>0x224</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_dout_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_test</name>
						<description>se_trng_0_test.</description>
						<addressOffset>0x228</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_ht_alarm_n</name>
								<lsb>4</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_trng_0_ht_dis</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_trng_0_cp_bypass</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_trng_0_cp_test_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_trng_0_test_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_1</name>
						<description>se_trng_0_ctrl_1.</description>
						<addressOffset>0x22C</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_reseed_n_lsb</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_2</name>
						<description>se_trng_0_ctrl_2.</description>
						<addressOffset>0x230</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_reseed_n_msb</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_3</name>
						<description>se_trng_0_ctrl_3.</description>
						<addressOffset>0x234</addressOffset>
						<fields>
							<field>
								<name>se_trng_0_rosc_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_trng_0_ht_od_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>se_trng_0_ht_apt_c</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>se_trng_0_ht_rct_c</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_trng_0_cp_ratio</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
