Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>ef_data_0</name>
				<description>ef_data_0.</description>
				<baseAddress>0x40007000</baseAddress>
				<groupName>ef_data_0</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>ef_cfg_0</name>
						<description>ef_cfg_0.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>ef_dbg_mode</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_dbg_jtag_0_dis</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ef_dbg_jtag_1_dis</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ef_efuse_dbg_dis</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ef_se_dbg_dis</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ef_cpu_rst_dbg_dis</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ef_cpu1_dis</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ef_sf_dis</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ef_cam_dis</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ef_0_key_enc_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ef_wifi_dis</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ef_ble_dis</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ef_sdu_dis</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ef_sw_usage_1</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ef_boot_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ef_cpu0_enc_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ef_cpu1_enc_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ef_sboot_en</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ef_sboot_sign_mode</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ef_sf_aes_mode</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_dbg_pwd_low</name>
						<description>ef_dbg_pwd_low.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>ef_dbg_pwd_low</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_dbg_pwd_high</name>
						<description>ef_dbg_pwd_high.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>ef_dbg_pwd_high</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_ana_trim_0</name>
						<description>ef_ana_trim_0.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>ef_ana_trim_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_sw_usage_0</name>
						<description>ef_sw_usage_0.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>ef_sw_usage_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_wifi_mac_low</name>
						<description>ef_wifi_mac_low.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>ef_wifi_mac_low</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_wifi_mac_high</name>
						<description>ef_wifi_mac_high.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>ef_wifi_mac_high</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_0_w0</name>
						<description>ef_key_slot_0_w0.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_0_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_0_w1</name>
						<description>ef_key_slot_0_w1.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_0_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_0_w2</name>
						<description>ef_key_slot_0_w2.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_0_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_0_w3</name>
						<description>ef_key_slot_0_w3.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_0_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_1_w0</name>
						<description>ef_key_slot_1_w0.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_1_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_1_w1</name>
						<description>ef_key_slot_1_w1.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_1_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_1_w2</name>
						<description>ef_key_slot_1_w2.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_1_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_1_w3</name>
						<description>ef_key_slot_1_w3.</description>
						<addressOffset>0x38</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_1_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_2_w0</name>
						<description>ef_key_slot_2_w0.</description>
						<addressOffset>0x3C</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_2_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_2_w1</name>
						<description>ef_key_slot_2_w1.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_2_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_2_w2</name>
						<description>ef_key_slot_2_w2.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_2_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_2_w3</name>
						<description>ef_key_slot_2_w3.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_2_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_3_w0</name>
						<description>ef_key_slot_3_w0.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_3_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_3_w1</name>
						<description>ef_key_slot_3_w1.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_3_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_3_w2</name>
						<description>ef_key_slot_3_w2.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_3_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_3_w3</name>
						<description>ef_key_slot_3_w3.</description>
						<addressOffset>0x58</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_3_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_4_w0</name>
						<description>ef_key_slot_4_w0.</description>
						<addressOffset>0x5C</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_4_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_4_w1</name>
						<description>ef_key_slot_4_w1.</description>
						<addressOffset>0x60</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_4_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_4_w2</name>
						<description>ef_key_slot_4_w2.</description>
						<addressOffset>0x64</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_4_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_4_w3</name>
						<description>ef_key_slot_4_w3.</description>
						<addressOffset>0x68</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_4_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_5_w0</name>
						<description>ef_key_slot_5_w0.</description>
						<addressOffset>0x6C</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_5_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_5_w1</name>
						<description>ef_key_slot_5_w1.</description>
						<addressOffset>0x70</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_5_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_5_w2</name>
						<description>ef_key_slot_5_w2.</description>
						<addressOffset>0x74</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_5_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_key_slot_5_w3</name>
						<description>ef_key_slot_5_w3.</description>
						<addressOffset>0x78</addressOffset>
						<fields>
							<field>
								<name>ef_key_slot_5_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_data_0_lock</name>
						<description>ef_data_0_lock.</description>
						<addressOffset>0x7C</addressOffset>
						<fields>
							<field>
								<name>rd_lock_key_slot_5</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_4</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_3</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_2</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_1</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_0</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rd_lock_dbg_pwd</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_5_h</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_4_h</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_3</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_2</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_1</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_0</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>wr_lock_wifi_mac</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>wr_lock_sw_usage_0</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>wr_lock_dbg_pwd</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>wr_lock_boot_mode</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_5_l</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_4_l</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ef_ana_trim_1</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
