Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>pwm</name>
				<description>pwm.</description>
				<baseAddress>0x4000A400</baseAddress>
				<groupName>pwm</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>pwm_int_config</name>
						<description>pwm_int_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>pwm_int_clear</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pwm_interrupt_sts</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm0_clkdiv</name>
						<description>pwm0_clkdiv.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>pwm_clk_div</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm0_thre1</name>
						<description>pwm0_thre1.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>pwm_thre1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm0_thre2</name>
						<description>pwm0_thre2.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>pwm_thre2</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm0_period</name>
						<description>pwm0_period.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>pwm_period</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm0_config</name>
						<description>pwm0_config.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>pwm_sts_top</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pwm_stop_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pwm_sw_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pwm_sw_force_val</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pwm_stop_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pwm_out_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_clk_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm0_interrupt</name>
						<description>pwm0_interrupt.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>pwm_int_enable</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pwm_int_period_cnt</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm1_clkdiv</name>
						<description>pwm1_clkdiv.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>pwm_clk_div</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm1_thre1</name>
						<description>pwm1_thre1.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>pwm_thre1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm1_thre2</name>
						<description>pwm1_thre2.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>pwm_thre2</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm1_period</name>
						<description>pwm1_period.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>pwm_period</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm1_config</name>
						<description>pwm1_config.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>pwm_sts_top</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pwm_stop_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pwm_sw_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pwm_sw_force_val</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pwm_stop_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pwm_out_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_clk_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm1_interrupt</name>
						<description>pwm1_interrupt.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>pwm_int_enable</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pwm_int_period_cnt</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm2_clkdiv</name>
						<description>pwm2_clkdiv.</description>
						<addressOffset>0x60</addressOffset>
						<fields>
							<field>
								<name>pwm_clk_div</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm2_thre1</name>
						<description>pwm2_thre1.</description>
						<addressOffset>0x64</addressOffset>
						<fields>
							<field>
								<name>pwm_thre1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm2_thre2</name>
						<description>pwm2_thre2.</description>
						<addressOffset>0x68</addressOffset>
						<fields>
							<field>
								<name>pwm_thre2</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm2_period</name>
						<description>pwm2_period.</description>
						<addressOffset>0x6C</addressOffset>
						<fields>
							<field>
								<name>pwm_period</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm2_config</name>
						<description>pwm2_config.</description>
						<addressOffset>0x70</addressOffset>
						<fields>
							<field>
								<name>pwm_sts_top</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pwm_stop_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pwm_sw_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pwm_sw_force_val</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pwm_stop_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pwm_out_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_clk_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm2_interrupt</name>
						<description>pwm2_interrupt.</description>
						<addressOffset>0x74</addressOffset>
						<fields>
							<field>
								<name>pwm_int_enable</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pwm_int_period_cnt</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm3_clkdiv</name>
						<description>pwm3_clkdiv.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>pwm_clk_div</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm3_thre1</name>
						<description>pwm3_thre1.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>pwm_thre1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm3_thre2</name>
						<description>pwm3_thre2.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>pwm_thre2</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm3_period</name>
						<description>pwm3_period.</description>
						<addressOffset>0x8C</addressOffset>
						<fields>
							<field>
								<name>pwm_period</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm3_config</name>
						<description>pwm3_config.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>pwm_sts_top</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pwm_stop_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pwm_sw_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pwm_sw_force_val</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pwm_stop_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pwm_out_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_clk_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm3_interrupt</name>
						<description>pwm3_interrupt.</description>
						<addressOffset>0x94</addressOffset>
						<fields>
							<field>
								<name>pwm_int_enable</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pwm_int_period_cnt</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm4_clkdiv</name>
						<description>pwm4_clkdiv.</description>
						<addressOffset>0xA0</addressOffset>
						<fields>
							<field>
								<name>pwm_clk_div</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm4_thre1</name>
						<description>pwm4_thre1.</description>
						<addressOffset>0xA4</addressOffset>
						<fields>
							<field>
								<name>pwm_thre1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm4_thre2</name>
						<description>pwm4_thre2.</description>
						<addressOffset>0xA8</addressOffset>
						<fields>
							<field>
								<name>pwm_thre2</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm4_period</name>
						<description>pwm4_period.</description>
						<addressOffset>0xAC</addressOffset>
						<fields>
							<field>
								<name>pwm_period</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm4_config</name>
						<description>pwm4_config.</description>
						<addressOffset>0xB0</addressOffset>
						<fields>
							<field>
								<name>pwm_sts_top</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pwm_stop_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pwm_sw_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pwm_sw_force_val</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pwm_stop_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pwm_out_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_clk_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pwm4_interrupt</name>
						<description>pwm4_interrupt.</description>
						<addressOffset>0xB4</addressOffset>
						<fields>
							<field>
								<name>pwm_int_enable</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pwm_int_period_cnt</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
