Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>timer</name>
				<description>timer.</description>
				<baseAddress>0x4000A500</baseAddress>
				<groupName>timer</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>TCCR</name>
						<description>TCCR.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>cs_wdt</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>RESERVED_7</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cs_2</name>
								<lsb>5</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>RESERVED_4</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cs_1</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMR2_0</name>
						<description>TMR2_0.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>tmr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMR2_1</name>
						<description>TMR2_1.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>tmr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMR2_2</name>
						<description>TMR2_2.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>tmr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMR3_0</name>
						<description>TMR3_0.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>tmr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMR3_1</name>
						<description>TMR3_1.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>tmr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMR3_2</name>
						<description>TMR3_2.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>tmr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCR2</name>
						<description>TCR2.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>tcr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCR3</name>
						<description>TCR3.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>tcr3_counter</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMSR2</name>
						<description>TMSR2.</description>
						<addressOffset>0x38</addressOffset>
						<fields>
							<field>
								<name>tmsr_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tmsr_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tmsr_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TMSR3</name>
						<description>TMSR3.</description>
						<addressOffset>0x3C</addressOffset>
						<fields>
							<field>
								<name>tmsr_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tmsr_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tmsr_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TIER2</name>
						<description>TIER2.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>tier_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tier_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tier_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TIER3</name>
						<description>TIER3.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>tier_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tier_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tier_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TPLVR2</name>
						<description>TPLVR2.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>tplvr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TPLVR3</name>
						<description>TPLVR3.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>tplvr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TPLCR2</name>
						<description>TPLCR2.</description>
						<addressOffset>0x5C</addressOffset>
						<fields>
							<field>
								<name>tplcr</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TPLCR3</name>
						<description>TPLCR3.</description>
						<addressOffset>0x60</addressOffset>
						<fields>
							<field>
								<name>tplcr</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WMER</name>
						<description>WMER.</description>
						<addressOffset>0x64</addressOffset>
						<fields>
							<field>
								<name>wrie</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>we</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WMR</name>
						<description>WMR.</description>
						<addressOffset>0x68</addressOffset>
						<fields>
							<field>
								<name>wmr</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WVR</name>
						<description>WVR.</description>
						<addressOffset>0x6C</addressOffset>
						<fields>
							<field>
								<name>wvr</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WSR</name>
						<description>WSR.</description>
						<addressOffset>0x70</addressOffset>
						<fields>
							<field>
								<name>wts</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TICR2</name>
						<description>TICR2.</description>
						<addressOffset>0x78</addressOffset>
						<fields>
							<field>
								<name>tclr_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tclr_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tclr_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TICR3</name>
						<description>TICR3.</description>
						<addressOffset>0x7C</addressOffset>
						<fields>
							<field>
								<name>tclr_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tclr_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tclr_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WICR</name>
						<description>WICR.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>wiclr</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCER</name>
						<description>TCER.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>timer3_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>timer2_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCMR</name>
						<description>TCMR.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>timer3_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>timer2_mode</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TILR2</name>
						<description>TILR2.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>tilr_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tilr_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tilr_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TILR3</name>
						<description>TILR3.</description>
						<addressOffset>0x94</addressOffset>
						<fields>
							<field>
								<name>tilr_2</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tilr_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tilr_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WCR</name>
						<description>WCR.</description>
						<addressOffset>0x98</addressOffset>
						<fields>
							<field>
								<name>wcr</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WFAR</name>
						<description>WFAR.</description>
						<addressOffset>0x9C</addressOffset>
						<fields>
							<field>
								<name>wfar</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WSAR</name>
						<description>WSAR.</description>
						<addressOffset>0xA0</addressOffset>
						<fields>
							<field>
								<name>wsar</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCVWR2</name>
						<description>TCVWR2.</description>
						<addressOffset>0xA8</addressOffset>
						<fields>
							<field>
								<name>tcvwr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCVWR3</name>
						<description>TCVWR3.</description>
						<addressOffset>0xAC</addressOffset>
						<fields>
							<field>
								<name>tcvwr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCVSYN2</name>
						<description>TCVSYN2.</description>
						<addressOffset>0xB4</addressOffset>
						<fields>
							<field>
								<name>tcvsyn2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCVSYN3</name>
						<description>TCVSYN3.</description>
						<addressOffset>0xB8</addressOffset>
						<fields>
							<field>
								<name>tcvsyn3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TCDR</name>
						<description>TCDR.</description>
						<addressOffset>0xBC</addressOffset>
						<fields>
							<field>
								<name>wcdr</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tcdr3</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>tcdr2</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
