Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>ir</name>
				<description>ir.</description>
				<baseAddress>0x4000A600</baseAddress>
				<groupName>ir</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>irtx_config</name>
						<description>irtx_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_data_num</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_irtx_tail_hl_inv</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_irtx_tail_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_irtx_head_hl_inv</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_irtx_head_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_irtx_logic1_hl_inv</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_irtx_logic0_hl_inv</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_irtx_data_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_irtx_swm_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_irtx_mod_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_irtx_out_inv</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_irtx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_int_sts</name>
						<description>irtx_int_sts.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_end_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>cr_irtx_end_clr</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_irtx_end_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>irtx_end_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_data_word0</name>
						<description>irtx_data_word0.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_data_word0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_data_word1</name>
						<description>irtx_data_word1.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_data_word1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_pulse_width</name>
						<description>irtx_pulse_width.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_mod_ph1_w</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_irtx_mod_ph0_w</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_irtx_pw_unit</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_pw</name>
						<description>irtx_pw.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_tail_ph1_w</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_irtx_tail_ph0_w</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_irtx_head_ph1_w</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_irtx_head_ph0_w</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_irtx_logic1_ph1_w</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_irtx_logic1_ph0_w</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_irtx_logic0_ph1_w</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_irtx_logic0_ph0_w</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_0</name>
						<description>irtx_swm_pw_0.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_1</name>
						<description>irtx_swm_pw_1.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_2</name>
						<description>irtx_swm_pw_2.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_3</name>
						<description>irtx_swm_pw_3.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_4</name>
						<description>irtx_swm_pw_4.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_5</name>
						<description>irtx_swm_pw_5.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_6</name>
						<description>irtx_swm_pw_6.</description>
						<addressOffset>0x58</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irtx_swm_pw_7</name>
						<description>irtx_swm_pw_7.</description>
						<addressOffset>0x5C</addressOffset>
						<fields>
							<field>
								<name>cr_irtx_swm_pw_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_config</name>
						<description>irrx_config.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>cr_irrx_deg_cnt</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_irrx_deg_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_irrx_mode</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_irrx_in_inv</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_irrx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_int_sts</name>
						<description>irrx_int_sts.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>cr_irrx_end_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>cr_irrx_end_clr</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_irrx_end_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>irrx_end_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_pw_config</name>
						<description>irrx_pw_config.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>cr_irrx_end_th</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_irrx_data_th</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_data_count</name>
						<description>irrx_data_count.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>sts_irrx_data_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_data_word0</name>
						<description>irrx_data_word0.</description>
						<addressOffset>0x94</addressOffset>
						<fields>
							<field>
								<name>sts_irrx_data_word0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_data_word1</name>
						<description>irrx_data_word1.</description>
						<addressOffset>0x98</addressOffset>
						<fields>
							<field>
								<name>sts_irrx_data_word1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_swm_fifo_config_0</name>
						<description>irrx_swm_fifo_config_0.</description>
						<addressOffset>0xC0</addressOffset>
						<fields>
							<field>
								<name>rx_fifo_cnt</name>
								<lsb>4</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rx_fifo_underflow</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rx_fifo_overflow</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rx_fifo_clr</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>irrx_swm_fifo_rdata</name>
						<description>irrx_swm_fifo_rdata.</description>
						<addressOffset>0xC4</addressOffset>
						<fields>
							<field>
								<name>rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
