Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
					<register>
						<name>sf_if_iahb_7</name>
						<description>sf_if_iahb_7.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>sf_if_3_cmd_buf_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_ctrl_prot_en_rd</name>
						<description>sf_ctrl_prot_en_rd.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>sf_dbg_dis</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_if_0_trig_wr_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>sf_ctrl_id1_en_rd</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>sf_ctrl_id0_en_rd</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sf_ctrl_prot_en_rd</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_ctrl_prot_en</name>
						<description>sf_ctrl_prot_en.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>sf_ctrl_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>sf_ctrl_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sf_ctrl_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_0</name>
						<description>sf_aes_key_r0_0.</description>
						<addressOffset>0x200</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_1</name>
						<description>sf_aes_key_r0_1.</description>
						<addressOffset>0x204</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_2</name>
						<description>sf_aes_key_r0_2.</description>
						<addressOffset>0x208</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_3</name>
						<description>sf_aes_key_r0_3.</description>
						<addressOffset>0x20C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_4</name>
						<description>sf_aes_key_r0_4.</description>
						<addressOffset>0x210</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_5</name>
						<description>sf_aes_key_r0_5.</description>
						<addressOffset>0x214</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_6</name>
						<description>sf_aes_key_r0_6.</description>
						<addressOffset>0x218</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r0_7</name>
						<description>sf_aes_key_r0_7.</description>
						<addressOffset>0x21C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r0_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r0_w0</name>
						<description>sf_aes_iv_r0_w0.</description>
						<addressOffset>0x220</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r0_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r0_w1</name>
						<description>sf_aes_iv_r0_w1.</description>
						<addressOffset>0x224</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r0_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r0_w2</name>
						<description>sf_aes_iv_r0_w2.</description>
						<addressOffset>0x228</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r0_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r0_w3</name>
						<description>sf_aes_iv_r0_w3.</description>
						<addressOffset>0x22C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r0_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_cfg_r0</name>
						<description>sf_aes_cfg_r0.</description>
						<addressOffset>0x230</addressOffset>
						<fields>
							<field>
								<name>sf_aes_region_r0_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_aes_region_r0_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>sf_aes_region_r0_hw_key_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>sf_aes_region_r0_start</name>
								<lsb>14</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf_aes_region_r0_end</name>
								<lsb>0</lsb>
								<msb>13</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_0</name>
						<description>sf_aes_key_r1_0.</description>
						<addressOffset>0x300</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_1</name>
						<description>sf_aes_key_r1_1.</description>
						<addressOffset>0x304</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_2</name>
						<description>sf_aes_key_r1_2.</description>
						<addressOffset>0x308</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_3</name>
						<description>sf_aes_key_r1_3.</description>
						<addressOffset>0x30C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_4</name>
						<description>sf_aes_key_r1_4.</description>
						<addressOffset>0x310</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_5</name>
						<description>sf_aes_key_r1_5.</description>
						<addressOffset>0x314</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_6</name>
						<description>sf_aes_key_r1_6.</description>
						<addressOffset>0x318</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r1_7</name>
						<description>sf_aes_key_r1_7.</description>
						<addressOffset>0x31C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r1_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r1_w0</name>
						<description>sf_aes_iv_r1_w0.</description>
						<addressOffset>0x320</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r1_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r1_w1</name>
						<description>sf_aes_iv_r1_w1.</description>
						<addressOffset>0x324</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r1_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r1_w2</name>
						<description>sf_aes_iv_r1_w2.</description>
						<addressOffset>0x328</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r1_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r1_w3</name>
						<description>sf_aes_iv_r1_w3.</description>
						<addressOffset>0x32C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r1_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_r1</name>
						<description>sf_aes_r1.</description>
						<addressOffset>0x330</addressOffset>
						<fields>
							<field>
								<name>sf_aes_r1_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_aes_r1_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>sf_aes_r1_hw_key_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>sf_aes_r1_start</name>
								<lsb>14</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf_aes_r1_end</name>
								<lsb>0</lsb>
								<msb>13</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_0</name>
						<description>sf_aes_key_r2_0.</description>
						<addressOffset>0x400</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_1</name>
						<description>sf_aes_key_r2_1.</description>
						<addressOffset>0x404</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_2</name>
						<description>sf_aes_key_r2_2.</description>
						<addressOffset>0x408</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_3</name>
						<description>sf_aes_key_r2_3.</description>
						<addressOffset>0x40C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_4</name>
						<description>sf_aes_key_r2_4.</description>
						<addressOffset>0x410</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_5</name>
						<description>sf_aes_key_r2_5.</description>
						<addressOffset>0x414</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_6</name>
						<description>sf_aes_key_r2_6.</description>
						<addressOffset>0x418</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_key_r2_7</name>
						<description>sf_aes_key_r2_7.</description>
						<addressOffset>0x41C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_key_r2_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r2_w0</name>
						<description>sf_aes_iv_r2_w0.</description>
						<addressOffset>0x420</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r2_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r2_w1</name>
						<description>sf_aes_iv_r2_w1.</description>
						<addressOffset>0x424</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r2_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r2_w2</name>
						<description>sf_aes_iv_r2_w2.</description>
						<addressOffset>0x428</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r2_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_iv_r2_w3</name>
						<description>sf_aes_iv_r2_w3.</description>
						<addressOffset>0x42C</addressOffset>
						<fields>
							<field>
								<name>sf_aes_iv_r2_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_aes_r2</name>
						<description>sf_aes_r2.</description>
						<addressOffset>0x430</addressOffset>
						<fields>
							<field>
								<name>sf_aes_r2_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sf_aes_r2_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>sf_aes_r2_hw_key_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>sf_aes_r2_start</name>
								<lsb>14</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sf_aes_r2_end</name>
								<lsb>0</lsb>
								<msb>13</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_id0_offset</name>
						<description>sf_id0_offset.</description>
						<addressOffset>0x434</addressOffset>
						<fields>
							<field>
								<name>sf_id0_offset</name>
								<lsb>0</lsb>
								<msb>23</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sf_id1_offset</name>
						<description>sf_id1_offset.</description>
						<addressOffset>0x438</addressOffset>
						<fields>
							<field>
								<name>sf_id1_offset</name>
								<lsb>0</lsb>
								<msb>23</msb>
							</field>
						</fields>
					</register>
