Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/soc602_reg.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>dma</name>
				<description>dma.</description>
				<baseAddress>0x4000C000</baseAddress>
				<groupName>dma</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>DMA_IntStatus</name>
						<description>DMA_IntStatus.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>IntStatus</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_IntTCStatus</name>
						<description>DMA_IntTCStatus.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>IntTCStatus</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_IntTCClear</name>
						<description>DMA_IntTCClear.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>IntTCClear</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_IntErrorStatus</name>
						<description>DMA_IntErrorStatus.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>IntErrorStatus</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_IntErrClr</name>
						<description>DMA_IntErrClr.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>IntErrClr</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_RawIntTCStatus</name>
						<description>DMA_RawIntTCStatus.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>RawIntTCStatus</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_RawIntErrorStatus</name>
						<description>DMA_RawIntErrorStatus.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>RawIntErrorStatus</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_EnbldChns</name>
						<description>DMA_EnbldChns.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>EnabledChannels</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_SoftBReq</name>
						<description>DMA_SoftBReq.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>SoftBReq</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_SoftSReq</name>
						<description>DMA_SoftSReq.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>SoftSReq</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_SoftLBReq</name>
						<description>DMA_SoftLBReq.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>SoftLBReq</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_SoftLSReq</name>
						<description>DMA_SoftLSReq.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>SoftLSReq</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_Top_Config</name>
						<description>DMA_Top_Config.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>M</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_Sync</name>
						<description>DMA_Sync.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>DMA_Sync</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C0SrcAddr</name>
						<description>DMA_C0SrcAddr.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>SrcAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C0DstAddr</name>
						<description>DMA_C0DstAddr.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>DstAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C0LLI</name>
						<description>DMA_C0LLI.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>LLI</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C0Control</name>
						<description>DMA_C0Control.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>I</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>Prot</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>DI</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>SI</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>SLargerD</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>DWidth</name>
								<lsb>21</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>SWidth</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>DBSize</name>
								<lsb>15</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>SBSize</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>TransferSize</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C0Config</name>
						<description>DMA_C0Config.</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>LLICounter</name>
								<lsb>20</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>H</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>A</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>L</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ITC</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>IE</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>FlowCntrl</name>
								<lsb>11</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>DstPeripheral</name>
								<lsb>6</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>SrcPeripheral</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C1SrcAddr</name>
						<description>DMA_C1SrcAddr.</description>
						<addressOffset>0x200</addressOffset>
						<fields>
							<field>
								<name>SrcAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C1DstAddr</name>
						<description>DMA_C1DstAddr.</description>
						<addressOffset>0x204</addressOffset>
						<fields>
							<field>
								<name>DstAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C1LLI</name>
						<description>DMA_C1LLI.</description>
						<addressOffset>0x208</addressOffset>
						<fields>
							<field>
								<name>LLI</name>
								<lsb>2</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C1Control</name>
						<description>DMA_C1Control.</description>
						<addressOffset>0x20C</addressOffset>
						<fields>
							<field>
								<name>I</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>Prot</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>DI</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>SI</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>DWidth</name>
								<lsb>21</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>SWidth</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>DBSize</name>
								<lsb>15</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>SBSize</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>TransferSize</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C1Config</name>
						<description>DMA_C1Config.</description>
						<addressOffset>0x210</addressOffset>
						<fields>
							<field>
								<name>H</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>A</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>L</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ITC</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>IE</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>FlowCntrl</name>
								<lsb>11</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>DstPeripheral</name>
								<lsb>6</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>SrcPeripheral</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C2SrcAddr</name>
						<description>DMA_C2SrcAddr.</description>
						<addressOffset>0x300</addressOffset>
						<fields>
							<field>
								<name>SrcAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C2DstAddr</name>
						<description>DMA_C2DstAddr.</description>
						<addressOffset>0x304</addressOffset>
						<fields>
							<field>
								<name>DstAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C2LLI</name>
						<description>DMA_C2LLI.</description>
						<addressOffset>0x308</addressOffset>
						<fields>
							<field>
								<name>LLI</name>
								<lsb>2</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C2Control</name>
						<description>DMA_C2Control.</description>
						<addressOffset>0x30C</addressOffset>
						<fields>
							<field>
								<name>I</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>Prot</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>DI</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>SI</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>DWidth</name>
								<lsb>21</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>SWidth</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>DBSize</name>
								<lsb>15</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>SBSize</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>TransferSize</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C2Config</name>
						<description>DMA_C2Config.</description>
						<addressOffset>0x310</addressOffset>
						<fields>
							<field>
								<name>H</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>A</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>L</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ITC</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>IE</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>FlowCntrl</name>
								<lsb>11</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>DstPeripheral</name>
								<lsb>6</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>SrcPeripheral</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C3SrcAddr</name>
						<description>DMA_C3SrcAddr.</description>
						<addressOffset>0x400</addressOffset>
						<fields>
							<field>
								<name>SrcAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C3DstAddr</name>
						<description>DMA_C3DstAddr.</description>
						<addressOffset>0x404</addressOffset>
						<fields>
							<field>
								<name>DstAddr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C3LLI</name>
						<description>DMA_C3LLI.</description>
						<addressOffset>0x408</addressOffset>
						<fields>
							<field>
								<name>LLI</name>
								<lsb>2</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C3Control</name>
						<description>DMA_C3Control.</description>
						<addressOffset>0x40C</addressOffset>
						<fields>
							<field>
								<name>I</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>Prot</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>DI</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>SI</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>DWidth</name>
								<lsb>21</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>SWidth</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>DBSize</name>
								<lsb>15</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>SBSize</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>TransferSize</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DMA_C3Config</name>
						<description>DMA_C3Config.</description>
						<addressOffset>0x410</addressOffset>
						<fields>
							<field>
								<name>H</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>A</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>L</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ITC</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>IE</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>FlowCntrl</name>
								<lsb>11</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>DstPeripheral</name>
								<lsb>6</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>SrcPeripheral</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>E</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
